[
    {
        "id": 1,
        "title": "RedParts",
        "img": "https://i.ibb.co.com/ksj4YGf4/Screenshot-2025-10-28-033532.png",
        "tech": [
            "React",
            "Tailwind CSS",
            "Framer Motion"
        ],
        "description": "RedParts is a modern and fully responsive portfolio website designed to showcase personal skills, projects, and educational background with smooth animations and clean UI components.",
        "challengingPart": "The most challenging part was implementing smooth scroll animations and transitions using Framer Motion while maintaining performance and responsiveness across all devices.",
        "live": "https://redparts.netlify.app/"
    },
    {
        "id": 2,
        "title": "EcoBazar",
        "img": "https://i.ibb.co.com/bM4F1ZDB/Screenshot-2025-10-28-033027.png",
        "tech": [
            "HTML",
            "Tailwind CSS"
        ],
        "description": "EcoBazar is a clean and minimal e-commerce landing page showcasing featured products, deals, and categories with an eye-catching layout built using Tailwind CSS.",
        "challengingPart": "The main challenge was creating a flexible and fully responsive grid layout that looks balanced across different screen sizes.",
        "live": "https://inspiring-semifreddo-495529.netlify.app/"
    },
    {
        "id": 3,
        "title": "Donation",
        "img": "https://i.ibb.co.com/mCWr4tGx/Screenshot-2025-10-28-062650.png",
        "tech": [
            "HTML",
            "Tailwind CSS",
            "JS"
        ],
        "description": "Donation is an interactive web app that allows users to donate to various causes and categories, showing real-time updates and total contributions dynamically.",
        "challengingPart": "The most challenging part was building a real-time donation counter and filter system using JavaScript to update data dynamically without reloading the page.",
        "live": "https://graceful-cendol-8d9335.netlify.app/"
    },
    {
        "id": 4,
        "title": "Medifit",
        "img": "https://i.ibb.co.com/tGDDMYM/Screenshot-2025-10-28-035630.png",
        "tech": [
            "HTML",
            "CSS"
        ],
        "description": "Medifit is a modern health and fitness website design featuring sections for training programs, expert doctors, and health consultation. It focuses on visual balance and user-friendly layouts.",
        "challengingPart": "Creating elegant hover animations and perfect section alignment purely with CSS (without JavaScript) was the most challenging part.",
        "live": "https://darling-toffee-be8a16.netlify.app/"
    },
    {
        "id": 5,
        "title": "BookShelf",
        "img": "https://i.ibb.co.com/6Vh29fD/Screenshot-2025-10-28-034336.png",
        "tech": [
            "HTML",
            "Tailwind CSS",
            "JS"
        ],
        "description": "BookShelf is an interactive blogging platform where users can write, read, and delete posts. It includes markdown support and stores data using local storage.",
        "challengingPart": "The most challenging part was integrating the markdown parser and managing post data efficiently in local storage.",
        "live": "https://velvety-semifreddo-d3422b.netlify.app/"
    }
]